/**
 * 菜单model 一级菜单 id,icon,name,menus2(子菜单) 
 * 二级菜单 id2,url2,icon2,name2, 
 * 心酸，懒得写继承了
 * 心酸，面向对象js都不会了
 */

var menus = [ {
	"id" : "10",
	"name" : "一级菜单",
	"icon" : "#",
	"menus2" : [ {
		"id" : "101",
		"name" : "二级菜单",
		"url" : "test.jsp",
		"icon" : "#"
	}, {
		"id" : "1011",
		"name" : "二级菜单",
		"url" : "#",
		"icon" : "#"
	}, {
		"id" : "1012",
		"name" : "二级菜单",
		"url" : "#",
		"icon" : "#"
	} ]
}, {
	"id" : "10",
	"name" : "一级菜单",
	"icon" : "#",
	"menus2" : [ {
		"id" : "101",
		"name" : "二级菜单",
		"url" : "#",
		"icon" : "#"
	}, {
		"id" : "1011",
		"name" : "二级菜单",
		"url" : "#",
		"icon" : "#"
	}, {
		"id" : "1012",
		"name" : "二级菜单",
		"url" : "#",
		"icon" : "#"
	} ]
}, {
	"id" : "10",
	"name" : "一级菜单",
	"icon" : "#",
	"menus2" : [ {
		"id" : "101",
		"name" : "二级菜单",
		"url" : "#",
		"icon" : "#"
	}, {
		"id" : "1011",
		"name" : "二级菜单",
		"url" : "#",
		"icon" : "#"
	}, {
		"id" : "1012",
		"name" : "二级菜单",
		"url" : "#",
		"icon" : "#"
	} ]
}, {
	"id" : "10",
	"name" : "一级菜单",
	"icon" : "#",
	"menus2" : [ {
		"id" : "101",
		"name" : "二级菜单",
		"url" : "#",
		"icon" : "#"
	}, {
		"id" : "1011",
		"name" : "二级菜单",
		"url" : "#",
		"icon" : "#"
	}, {
		"id" : "1012",
		"name" : "二级菜单",
		"url" : "#",
		"icon" : "#"
	} ]
},

];
